export const movies = [
  {
    id: 1,
    name: 'Железный человек',
    imagePath: './images/ironMan.jpeg',
    genre: 'Фантастика',
    year: 2008,
    description:
      'Миллиардер-изобретатель Тони Старк попадает в плен к Афганским террористам, которые пытаются заставить его создать оружие массового поражения. В тайне от своих захватчиков Старк конструирует высокотехнологичную киберброню, которая помогает ему сбежать. Однако по возвращении в США он узнаёт, что в совете директоров его фирмы плетётся заговор, чреватый страшными последствиями. Используя своё последнее изобретение, Старк пытается решить проблемы своей компании радикально...',
  },
  {
    id: 2,
    name: 'Железный человек 2',
    imagePath: './images/iron-Man-2.jpg',
    genre: 'Фантастика',
    year: 2010,
    description:
      'Прошло полгода с тех пор, как мир узнал, что миллиардер-изобретатель Тони Старк является обладателем уникальной кибер-брони Железного человека. Общественность требует, чтобы Старк передал технологию брони правительству США, но Тони не хочет разглашать её секреты, потому что боится, что она попадёт не в те руки. Между тем Иван Ванко — сын русского учёного, когда-то работавшего на фирму Старка, но потом уволенного и лишенного всего, намерен отомстить Тони за беды своей семьи. Для чего сооружает своё высокотехнологичное оружие.',
  },
  {
    id: 3,
    name: 'Железный человек 3',
    imagePath: './images/iron-Man-3.jpg',
    genre: 'Фантастика',
    year: 2013,
    description:
      'Когда мир Старка рушится на его глазах по вине неизвестных противников, Тони жаждет найти виновных и свести с ними счеты. Оказавшись в безвыходной ситуации, Старк может рассчитывать только на себя и свою изобретательность, чтобы защитить тех, кто ему дорог. Это становится настоящим испытанием для героя, которому придется не только сражаться с коварным врагом, но и разобраться в себе, чтобы найти ответ на вопрос, который давно его тревожит: что важнее - человек или костюм?',
  },
  {
    id: 4,
    name: 'Астрал',
    imagePath: './images/astral.jpg',
    genre: 'Ужасы',
    year: 2010,
    description:
      'Джош и Рене переезжают со своими детьми в новый дом, но не успевают толком распаковать вещи, как начинаются странные события. Необъяснимо перемещаются предметы, в детской звучат странные звуки… Но в настоящий ужас приходят родители, когда их десятилетний сын Далтон впадает в кому. Все усилия врачей в больнице помочь мальчику безуспешны.',
  },
  {
    id: 5,
    name: 'Синистер',
    imagePath: './images/sinister.jpg',
    genre: 'Ужасы',
    year: 2012,
    description:
      'Вместе с семьей автор детективов поселяется в небольшом городке, в доме, где почти год назад развернулась леденящая душу трагедия — были убиты все жильцы. Писатель случайно находит видеозаписи, которые являются ключом к тайне преступления. Но ничто не дается даром: в доме начинают происходить жуткие вещи и теперь под угрозой жизнь его близких. Они столкнулись с чем-то, от чего нет спасения…',
  },
  {
    id: 6,
    name: 'Синистер 2',
    imagePath: './images/sinister-2.jpg',
    genre: 'Ужасы',
    year: 2015,
    description:
      'История о молодом шерифе, решившем продолжить расследование серии таинственных убийств, описанной в первой части фильма, из-за которых в своё время потерял жизнь его друг, сержант Элиссон Освальф. Расследование приводит его к ферме, где он знакомится с дружелюбной семьей– близнецами Заком, Диланом и их матерью Кортни, которые сбежали от издевательств их жестокого отца. Каждый день, проведенный в этом доме, может стать их последним днем, как и для всех, кто жил здесь до них и попал в поле зрения самой смерти – беспощадного демона Багула...',
  },
  {
    id: 7,
    name: 'Мачо и ботан',
    imagePath: './images/21-jump-street.jpg',
    genre: 'Комедия',
    year: 2012,
    description:
      'Двое новоиспеченных горе-полицейских отправляются на сверхсекретное задание. Им предстоит заново стать учениками средней школы, в которой процветает наркоторговля.',
  },
  {
    id: 8,
    name: 'Мачо и ботан 2',
    imagePath: './images/22-jump-street.jpg',
    genre: 'Комедия',
    year: 2014,
    description:
      'Офицерам Шмидту и Дженко теперь предстоит работать под прикрытием в местном колледже. Однако когда Дженко встречает родственную душу в футбольной команде, а Шмидт проникает в богемную среду, они начинают сомневаться в их товариществе…',
  },
  {
    id: 9,
    name: 'Легенда 17',
    imagePath: './images/legend-17.jpeg',
    genre: 'Документальный',
    year: 2013,
    description:
      '2 сентября 1972 года. Монреаль. Хоккейная сборная СССР с разгромным счетом 7:3 победила канадских профессионалов из НХЛ в стартовом матче эпохальной Суперсерии СССР-Канада. Это была не просто игра, это была битва за свою страну, которая перевернула мировое представление о хоккее. Теперь весь мир знал его просто по номеру «17». Валерий Харламов, забивший в том матче 2 шайбы мгновенно взлетел на вершину славы. Сбылась его мечта –упорство, спортивный талант и суровые уроки великого тренера Анатолия Тарасова сделали из «номера 17» легенду мирового хоккея.',
  },
  {
    id: 10,
    name: 'Джон уик 3',
    imagePath: './images/wick-3.jpg',
    genre: 'Боевик',
    year: 2019,
    description:
      'Элитному наемному убийце Джону Уику в третий раз не удается уйти на пенсию. Он нарушил законы отеля для киллеров «Континенталь», совершив убийство на его территории, и сам стал мишенью для полчищ наемников. У Джона остается последний шанс, чтобы сбежать из Нью-Йорка.',
  },
  {
    id: 11,
    name: 'Джон уик 4',
    imagePath: './images/wick-4.jpg',
    genre: 'Боевик',
    year: 2023,
    description:
      'Джон Уик находит способ одержать победу над Правлением Кланов. Однако, прежде чем он сможет заслужить свою свободу, ему предстоит сразиться с новым врагом и его могущественными союзниками.',
  },
]

export const serials = [
  {
    id: 1,
    name: 'Ходячие мертвецы',
    imagePath: './images/walking-dead.jpg',
    genre: 'Фантастика',
    year: 2010,
    description:
      '«Ходя́чие мертвецы́» (англ. The Walking Dead) — американский постапокалиптический телесериал, разработанный Фрэнком Дарабонтом и основанный на одноимённой серии комиксов, созданной Робертом Киркманом, Тони Муром и Чарли Адлардом. В центре сюжета небольшая группа людей, пытающихся выжить во время зомби-апокалипсиса.',
  },
  {
    id: 2,
    name: 'Одни из нас',
    imagePath: './images/the-last-of-us.jpg',
    genre: 'Фантастика',
    year: 2023,
    description:
      'Основан на компьютерной игре 2013 года The Last of Us, разработанной компанией Naughty Dog, и рассказывает историю контрабандиста Джоэла (Педро Паскаль), который сопровождает девочку-подростка Элли (Белла Рамзи) через постапокалиптические США. Это первый сериал HBO, основанный на видеоигре.',
  },
  {
    id: 3,
    name: 'Эпидемия',
    imagePath: './images/epidemy.jpg',
    genre: 'Фантастика',
    year: 2019,
    description:
      'Новый неизвестный вирус превращает Москву в город мёртвых. Электричества нет, деньги потеряли свою ценность, те, кто ещё не заражён, отчаянно сражаются за еду и бензин. Сергей, его любимая и её сын-аутист живут за городом, где пока ещё безопасно. Но он не может бросить в беде бывшую жену с сыном, хоть она и ненавидит его. Сергей едет в Москву и чудом вывозит из умирающей столицы женщину и ребёнка. В пути к ним присоединяются также отец героя и довольно наглые соседи. Люди, которые в другой ситуации никогда не оказались бы под одной крышей, вынуждены забыть прежние обиды и отправиться в полное смертельных опасностей путешествие в Карелию, к уединенному охотничьему домику, расположенному на необитаемом острове посреди озера.',
  },
  {
    id: 4,
    name: 'Друзья',
    imagePath: './images/friends.jpg',
    genre: 'Комедия',
    year: 1994,
    description:
      'Сериал посвящён жизни шестерых друзей: избалованной «папенькиной дочки» Рэйчел Грин (Дженнифер Энистон); чистюли-повара Моники Геллер (Кортни Кокс); комплексующего остряка, офисного работника Чендлера Бинга (Мэттью Перри); помешанного на сексе и еде, простоватого, ждущего «своей» роли актёра Джоуи Триббиани (Мэтт Леблан); разведённого палеонтолога Росса Геллера (Дэвид Швиммер); хиппующей массажистки и певицы Фиби Буффе (Лиза Кудроу).',
  },
  {
    id: 5,
    name: 'Голяк',
    imagePath: './images/brassic.jpg',
    genre: 'Комедия',
    year: 2019,
    description:
      '«Голяк» — британский комедийный сериал, созданный Джо Гилганом и Дэнни Броклхёрстом . Премьера состоялась 22 августа 2019 года на канале Sky One в Соединенном Королевстве. В нем рассказывается о жизни Винни и пятерых его друзей, которые живут своей жизнью в северном городе Хоули.',
  },
  {
    id: 6,
    name: 'Бумажный дом',
    imagePath: './images/bum-house.jpg',
    genre: 'Боевик',
    year: 2017,
    description:
      'Восемь воров берут заложников и запираются в Королевском монетном дворе Испании, пока криминальный авторитет манипулирует полицией, чтобы реализовать свой план. Смотрите сколько хотите. Этот захватывающий сериал получил премии «Эмми», Premios Fénix и Iris в номинации «Лучшая драма» (и еще 6 наград Iris).',
  },
  {
    id: 7,
    name: 'Банши',
    imagePath: './images/banshee.jpg',
    genre: 'Боевик',
    year: 2013,
    description:
      'Отсидев 15 лет за ограбление, главный герой (Энтони Старр) присваивает личность убитого шерифа и становится шерифом округа Банши, штат Пенсильвания, где живёт его бывшая напарница Эна (Ивана Миличевич).',
  },
  {
    id: 8,
    name: 'Полярный',
    imagePath: './images/polyarnii.jpg',
    genre: 'Комедия',
    year: 2019,
    description:
      'Известный в середине 90-х бандит Витя Мясник, давно отошедший от дел и владеющий экофермой, по просьбе бывшего подельника согласился передержать на своём офшорном банковском счёте воровской общак. Когда же пришло время возвращать деньги, волей обстоятельств Витя забыл пароль от счёта.',
  },
  {
    id: 9,
    name: 'Универ. Новая общага',
    imagePath: './images/univer.jpg',
    genre: 'Комедия',
    year: 2011,
    description:
      'Новая общага» — российский сериал-ситком, повествующий о жизни студентов, проживающих в одном блоке общежития. Одно из продолжений телесериала «Универ». Транслировался каналом «ТНТ» с 10 октября 2011 года по 1 октября 2018 года. С 3 сезона сериал снова носил название «Универ».',
  },
  {
    id: 10,
    name: 'Полицейский с рублевки',
    imagePath: './images/policeman-rublevka.jpg',
    genre: 'Комедия',
    year: 2016,
    description:
      '«Полицейский с Рублёвки» — это история о Грише Измайлове, полицейском, который призван охранять покой и порядок в самом элитном районе России, где живут невероятно богатые люди. Ему приходится расследовать дела, в которые впутываются жители Рублевки, и делает он это нередко превышая свои полномочия. Грише около 30 лет, он красив, одинок, богат, циничен, азартен и ко всему относится с изрядной долей черного юмора. Он заботится о младшей сестре-хулиганке, которую вынужден постоянно вытаскивать из неприятностей. Гриша не прикладывая усилий умеет нравиться женщинам и регулярно издевается над своим начальником Яковлевым.',
  },
  {
    id: 11,
    name: 'Шерлок',
    imagePath: './images/sherlock.jpg',
    genre: 'Детектив',
    year: 2010,
    description:
      'События разворачиваются в наши дни. Он прошел Афганистан, остался инвалидом. По возвращении в родные края встречается с загадочным, но своеобразным гениальным человеком. Тот в поиске соседа по квартире. Лондон, 2010 год. Происходят необъяснимые убийства. Скотланд-Ярд без понятия, за что хвататься. Существует лишь один человек, который в силах разрешить проблемы и найти ответы на сложные вопросы.',
  },
]

export const cartoons = [
  {
    id: 1,
    name: 'История игрушек',
    imagePath: './images/toys-history.jpg',
    year: 1995,
    description:
      'Каждый ребенок верит, что когда он оставляет свои игрушки одни, они начинают заниматься своими делами. Этот мультипликационный фильм позволяет убедиться им в своей правоте.',
  },
  {
    id: 2,
    name: 'История игрушек 2',
    imagePath: './images/toys-history-2.png',
    year: 1999,
    description:
      'Ковбой Вуди и другие игрушки мальчика по имени Энди продолжают жить, радуясь каждому дню. Но неожиданно все меняется, когда Вуди похищает коварный коллекционер. Оказывается, что Вуди - очень ценная игрушка из коллекции, за которую японский музей игрушек готов заплатить огромную сумму.',
  },
  {
    id: 3,
    name: 'Тачки',
    imagePath: './images/cars.jpg',
    year: 2006,
    description:
      'Неукротимый в своем желании всегда и во всем побеждать гоночный автомобиль «Молния» Маккуин вдруг обнаруживает, что сбился с пути и застрял в маленьком захолустном городке Радиатор-Спрингс, что находится где-то на трассе 66 в Калифорнии.',
  },
  {
    id: 4,
    name: 'Валли',
    imagePath: './images/walli.jpg',
    year: 2008,
    description:
      'Робот ВАЛЛ·И из года в год прилежно трудится на опустевшей Земле, очищая нашу планету от гор мусора, которые оставили после себя улетевшие в космос люди. Он и не представляет, что совсем скоро произойдут невероятные события, благодаря которым он встретит друзей, поднимется к звездам и даже сумеет изменить к лучшему своих бывших хозяев, совсем позабывших родную Землю.',
  },
  {
    id: 5,
    name: 'Корпорация монстров',
    imagePath: './images/monsters.jpg',
    year: 2001,
    description:
      'Склизский гад в сливном бачке, мохнатый зверь, похожий на чудовище из «Аленького цветочка», гигантские мокрицы под кроватью — все они существуют на самом деле. Все, что им нужно — пугать детей, потому что из детских криков они получают электричество.',
  },
  {
    id: 6,
    name: 'История игрушек 3',
    imagePath: './images/toy-story-3.jpg',
    year: 2010,
    description:
      'Энди почти 18 лет, ему остаётся 3 дня до отправки в колледж, в то время как его игрушки, в том числе Вуди и Базз Лайтер, гадают о своём будущем. Куда забросит их судьба? На чердак, на свалку или, может быть, в детский сад «Солнышко»? События развиваются в самом неожиданном направлении, и приключения полюбившихся героев продолжаются!',
  },
  {
    id: 7,
    name: 'Зверополис',
    imagePath: './images/zveropolis.jpg',
    year: 2016,
    description:
      'Добро пожаловать в Зверополис — современный город, населенный самыми разными животными, от огромных слонов до крошечных мышек. Зверополис разделен на районы, полностью повторяющие естественную среду обитания разных жителей — здесь есть и элитный район Площадь Сахары и неприветливый Тундратаун. В этом городе появляется новый офицер полиции, жизнерадостная зайчиха Джуди Хоппс, которая с первых дней работы понимает, как сложно быть маленькой и пушистой среди больших и сильных полицейских. Джуди хватается за первую же возможность проявить себя, несмотря на то, что ее партнером будет болтливый хитрый лис Ник Уайлд. Вдвоем им предстоит раскрыть сложное дело, от которого будет зависеть судьба всех обитателей Зверополиса.',
  },
  {
    id: 8,
    name: 'Подводная братва',
    imagePath: './images/water-brothers.jpg',
    year: 2004,
    description:
      'Весь подводный мир встревожен убийством сына главы главной преступной группировки акул и, надо же, на месте преступления находят ничего не подозревающего малька Оскара! Всю жизнь Оскар мечтал быть сильным и знаменитым, и вот ему представился прекрасный случай воспользоваться чужой славой. Но очень скоро Оскар понимает, что он натворил, взяв титул «Гроза Акул»…',
  },
  {
    id: 9,
    name: 'В поисках Дори',
    imagePath: './images/dory.jpg',
    year: 2016,
    description:
      'Дори — синяя доброжелательная рыбка-хирург, страдающая провалами в памяти. Она упорно стремится избавиться от своего недуга и найти свою семью.',
  },
  {
    id: 10,
    name: 'Шрэк',
    imagePath: './images/shrek.jpg',
    year: 2001,
    description:
      'Жил да был в сказочном государстве большой зеленый великан по имени Шрэк. Жил он в гордом одиночестве в лесу, на болоте, которое считал своим. Но однажды злобный коротышка — лорд Фаркуад, правитель волшебного королевства, безжалостно согнал на Шрэково болото всех сказочных обитателей...',
  },
  {
    id: 11,
    name: 'Шрэк навсегда',
    imagePath: './images/shrek-4.jpg',
    year: 2010,
    description:
      'Чем бы еще заняться огру, который уже сразился со злым драконом, спас прекрасную принцессу и уберег от беды королевство родственников по линии жены? Что ж, если вы Шрэк, то, сами того не заметив, вы вдруг сядете дома и станете наслаждаться покоем в кругу семьи. Вместо того чтобы как раньше пугать деревенских жителей, теперь Шрэк, хоть и с неохотой, но соглашается оставлять автографы на их вилах. А куда же подевался знаменитый рык этого огра?',
  },
]
